system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          2e-6;

writeControl    adjustable;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo 0.95;


functions
{

#include"FOyPlus";
#include"FOMachNo";

forceCoeffs_object
    {
	
	type forceCoeffs;
	libs ("libforces.so");
	
	patches ("airfoil");

	pName p;
	Uname U;
	rho rhoInf;
	rhoInf 1.0;

    CofR (0 0 0);
	liftDir (0 1 0);
	dragDir (1 0 0);
	magUInf 266.3969;
	lRef 0.010943;         
	Aref 0.010943;	

        writeControl   timeStep;
        writeInterval  1;

    }


}

// ************************************************************************* //
