system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

z 0.5;
x 1.0943;
y -0.0415;
y1 6.5;
x2 11;
x3 5.425;
dangle 80;
danngle2 45;
angle #calc"degToRad($dangle)";

vertices
(
    ( 0      0          $z)
    ( 0.5   -0.0644    $z)
    ( $x     $y         $z)
    ( 0.5    0.0678     $z)

    ( 0      0         -$z)
    ( 0.5   -0.0644   -$z)
    ( $x     $y        -$z)
    ( 0.5    0.0678    -$z)

    ( 0.5   -$y1        $z)
    ( $x2   -$y1        $z)
    ( $x2    $y1        $z)
    ( 0.5    $y1        $z)

    ( 0.5   -$y1       -$z)
    ( $x2   -$y1       -$z)
    ( $x2    $y1       -$z)
    ( 0.5    $y1       -$z)

    (-$x3     0         $z)
    ( $x2     0         $z)

    (-$x3     0        -$z)
    ( $x2     0        -$z)

    ( $x     $y1        $z)
    ( $x    -$y1        $z)
    ( $x     $y1       -$z)
    ( $x    -$y1       -$z)

    ($x      $y1        $z)
    ($x     -$y1        $z)
    ($x      $y         $z)
    
    ($x      $y1       -$z)
    ($x     -$y1       -$z)
    ($x      $y        -$z)

);

blocks
(
    hex ( 0 16 11  3  4 18 15  7) (100 50 1) simpleGrading (12000 0.1 1)
    hex ( 0  1  8 16  4  5 12 18) (50 100 1) simpleGrading (0.1 12000 1)
    hex ( 3 11 20  2  7 15 22  6) (100 50 1) simpleGrading (12000 1 1)
    hex ( 1  2 21  8  5  6 23 12) (50 100 1) simpleGrading (1 12000 1)
    hex (26 24 10 17 29 27 14 19) (50 100 1) simpleGrading (12000 100 1)
    hex (26 17  9 25 29 19 13 28) (100 50 1) simpleGrading (100 12000 1)
    
);

edges
(
    arc 16 11 (-2.75 5.196   $z)
    arc 18 15 (-2.75 5.196  -$z)
    arc 16  8 (-2.75 -5.196  $z)
    arc 18 12 (-2.75 -5.196 -$z)

polyLine 0 1
        (

(0 0 0.5)
(0.002 -0.0093 0.5)
(0.005 -0.016 0.5)
(0.01 -0.0221 0.5)
(0.02 -0.0295 0.5)
(0.03 -0.0344 0.5)
(0.04 -0.0381 0.5)
(0.05 -0.0412 0.5)
(0.07 -0.0462 0.5)
(0.1 -0.0517 0.5)
(0.12 -0.0547 0.5)
(0.15 -0.0585 0.5)
(0.17 -0.0606 0.5)
(0.2 -0.0633 0.5)
(0.22 -0.0647 0.5)
(0.25 -0.0666 0.5)
(0.28 -0.068 0.5)
(0.3 -0.0687 0.5)
(0.32 -0.0692 0.5)
(0.35 -0.0696 0.5)
(0.37 -0.0696 0.5)
(0.4 -0.0692 0.5)
(0.42 -0.0688 0.5)
(0.45 -0.0676 0.5)
(0.48 -0.0657 0.5)
(0.5 -0.0644 0.5)

        )

polyLine 1 2

        (
            (0.5 -0.0644 0.5)
(0.53 -0.0614 0.5)
(0.55 -0.0588 0.5)
(0.58 -0.0543 0.5)
(0.6 -0.0509 0.5)
(0.63 -0.0451 0.5)
(0.65 -0.041 0.5)
(0.68 -0.0346 0.5)
(0.7 -0.0302 0.5)
(0.73 -0.0235 0.5)
(0.75 -0.0192 0.5)
(0.77 -0.015 0.5)
(0.8 -0.0093 0.5)
(0.83 -0.0048 0.5)
(0.85 -0.0024 0.5)
(0.87 -0.0013 0.5)
(0.89 -0.0008 0.5)
(0.92 -0.0016 0.5)
(0.94 -0.0035 0.5)
(0.95 -0.0049 0.5)
(0.96 -0.0066 0.5)
(0.97 -0.0085 0.5)
(0.98 -0.0109 0.5)
(0.99 -0.0137 0.5)
(1  -0.0163  0.5)
(1.0943 -0.0415 0.5)

        )
polyLine 0 3
    (
        (0 0 0.5)
(0.002 0.0095 0.5)
(0.005 0.0158 0.5)
(0.01 0.0219 0.5)
(0.02 0.0293 0.5)
(0.03 0.0343 0.5)
(0.04 0.0381 0.5)
(0.05 0.0411 0.5)
(0.07 0.0462 0.5)
(0.1 0.0518 0.5)
(0.12 0.0548 0.5)
(0.15 0.0585 0.5)
(0.17 0.0606 0.5)
(0.2 0.0632 0.5)
(0.22 0.0646 0.5)
(0.25 0.0664 0.5)
(0.27 0.0673 0.5)
(0.3 0.0685 0.5)
(0.33 0.0692 0.5)
(0.35 0.0696 0.5)
(0.38 0.0698 0.5)
(0.4 0.0697 0.5)
(0.43 0.0695 0.5)
(0.45 0.0692 0.5)
(0.48 0.0684 0.5)
(0.5 0.0678 0.5)


    )

polyLine 3 2
        (
(0.5 0.0678 0.5)
(0.53 0.0666 0.5)
(0.55 0.0656 0.5)
(0.57 0.0645 0.5)
(0.6 0.0625 0.5)
(0.62 0.061 0.5)
(0.65 0.0585 0.5)
(0.68 0.0555 0.5)
(0.7 0.0533 0.5)
(0.72 0.0509 0.5)
(0.75 0.0469 0.5)
(0.77 0.0439 0.5)
(0.8 0.0389 0.5)
(0.82 0.0353 0.5)
(0.85 0.0294 0.5)
(0.87 0.0251 0.5)
(0.9 0.0181 0.5)
(0.92 0.0131 0.5)
(0.95 0.0049 0.5)
(0.97 -0.0009 0.5)
(0.98 -0.0039 0.5)
(0.99 -0.0071 0.5)
(1 -0.0104 0.5)
(1.0943 -0.0415 0.5)

        )


polyLine 4 5 

(
    (0 0 -0.5)
(0.002 -0.0093 -0.5)
(0.005 -0.016 -0.5)
(0.01 -0.0221 -0.5)
(0.02 -0.0295 -0.5)
(0.03 -0.0344 -0.5)
(0.04 -0.0381 -0.5)
(0.05 -0.0412 -0.5)
(0.07 -0.0462 -0.5)
(0.1 -0.0517 -0.5)
(0.12 -0.0547 -0.5)
(0.15 -0.0585 -0.5)
(0.17 -0.0606 -0.5)
(0.2 -0.0633 -0.5)
(0.22 -0.0647 -0.5)
(0.25 -0.0666 -0.5)
(0.28 -0.068 -0.5)
(0.3 -0.0687 -0.5)
(0.32 -0.0692 -0.5)
(0.35 -0.0696 -0.5)
(0.37 -0.0696 -0.5)
(0.4 -0.0692 -0.5)
(0.42 -0.0688 -0.5)
(0.45 -0.0676 -0.5)
(0.48 -0.0657 -0.5)
(0.5 -0.0644 -0.5)

)

polyLine 5 6

(
    (0.5 -0.0644 -0.5)
(0.53 -0.0614 -0.5)
(0.55 -0.0588 -0.5)
(0.58 -0.0543 -0.5)
(0.6 -0.0509 -0.5)
(0.63 -0.0451 -0.5)
(0.65 -0.041 -0.5)
(0.68 -0.0346 -0.5)
(0.7 -0.0302 -0.5)
(0.73 -0.0235 -0.5)
(0.75 -0.0192 -0.5)
(0.77 -0.015 -0.5)
(0.8 -0.0093 -0.5)
(0.83 -0.0048 -0.5)
(0.85 -0.0024 -0.5)
(0.87 -0.0013 -0.5)
(0.89 -0.0008 -0.5)
(0.92 -0.0016 -0.5)
(0.94 -0.0035 -0.5)
(0.95 -0.0049 -0.5)
(0.96 -0.0066 -0.5)
(0.97 -0.0085 -0.5)
(0.98 -0.0109 -0.5)
(0.99 -0.0137 -0.5)
(1  -0.0163  -0.5)
(1.0943 -0.0415 -0.5)
)

polyLine 4 7
(
    (0 0 -0.5)
(0.002 0.0095 -0.5)
(0.005 0.0158 -0.5)
(0.01 0.0219 -0.5)
(0.02 0.0293 -0.5)
(0.03 0.0343 -0.5)
(0.04 0.0381 -0.5)
(0.05 0.0411 -0.5)
(0.07 0.0462 -0.5)
(0.1 0.0518 -0.5)
(0.12 0.0548 -0.5)
(0.15 0.0585 -0.5)
(0.17 0.0606 -0.5)
(0.2 0.0632 -0.5)
(0.22 0.0646 -0.5)
(0.25 0.0664 -0.5)
(0.27 0.0673 -0.5)
(0.3 0.0685 -0.5)
(0.33 0.0692 -0.5)
(0.35 0.0696 -0.5)
(0.38 0.0698 -0.5)
(0.4 0.0697 -0.5)
(0.43 0.0695 -0.5)
(0.45 0.0692 -0.5)
(0.48 0.0684 -0.5)
(0.5 0.0678 -0.5)

)

polyLine 7 6
(
    (0.5 0.0678 -0.5)
(0.53 0.0666 -0.5)
(0.55 0.0656 -0.5)
(0.57 0.0645 -0.5)
(0.6 0.0625 -0.5)
(0.62 0.061 -0.5)
(0.65 0.0585 -0.5)
(0.68 0.0555 -0.5)
(0.7 0.0533 -0.5)
(0.72 0.0509 -0.5)
(0.75 0.0469 -0.5)
(0.77 0.0439 -0.5)
(0.8 0.0389 -0.5)
(0.82 0.0353 -0.5)
(0.85 0.0294 -0.5)
(0.87 0.0251 -0.5)
(0.9 0.0181 -0.5)
(0.92 0.0131 -0.5)
(0.95 0.0049 -0.5)
(0.97 -0.0009 -0.5)
(0.98 -0.0039 -0.5)
(0.99 -0.0071 -0.5)
(1 -0.0104 -0.5)
(1.0943 -0.0415 -0.5)
)
);

boundary
(
    interface1
    {
        type wall;
        faces
        (
            (20 2 6 22)
            
        );
    }
    
    interface2
    {
        type wall;
        faces
        (
            (26 24 27 29)
        );
    }

    interface3
    {
        type wall;
        faces
        (
            (26 29 28 25)
        );
    }
    
    interface4
    {
        type wall;
        faces
        (
            (2 21 23 6)
        );
    }

    inlet
    {
        type patch;
        inGroups (freestream);       
        faces
        (
            (16 11 15 18)
            (16 18 12  8)      
            (11 20 22 15)
            (8 21 23 12)
            (24 10 27 14)
            (25 28 13 9)
        );
    }

    outlet
    {
        type patch;
        inGroups (freestream);
        faces
        (
            (10 17 19 14)
            (17 9 13  19)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 11 16)
            (0 16 8 1)
            (1 8 21 2)
            (3 2 20 11)
            (26 17 10 24)
            (26 25 9 17)
            (4 18 15 7)
            (4 5 12 18)
            (7 15 22 6)
            (5 6 23 12)
            (29 27 14 19)
            (29 19 13 28)
        );

    }

    airfoil
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (0 4 5 1)
            (3 2 6 7)
            (1 5 6 2)
        );
    }

);

mergePatchPairs
(
    (interface1 interface2)
    (interface4 interface3)
);
