constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          400;
        startFace       59794;
    }
    outlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          100;
        startFace       60194;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          60000;
        startFace       60294;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       120294;
    }
)

// ************************************************************************* //
