system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionToCell;
        insidePoints ((0 0 0));
    }

    {
        name    c0;
        type    cellSet;
        action  subset;
        source  boxToCell;
        sourceInfo
        {
          boxes
          (
            (-0.5 -0.5 -5) (0.5 0.5 5) 
          );
          
        }
      }

      {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
          boxes
          (
            (-1.2 -1 -5) (2 1 5) 
          );
          
        }
      }

);
